package exam05;

public class Sample01 {
		   
/*
 *	상속
 *		1. 부모 / 자식간의 관계를 표현할 때 사용
 *		   상위 / 하위 개념 관계를 표현할 때 사용
 *		2. 부모의 멤버 변수, 메서드는 자식이 그대로 사용 가능
 *		   단, 자식은 오버라이드 기능을 사용하여 부모의 메서드를 재정의하여 사용 가능 
 * 		3. 생성자는 상속 안됨.
 * 		4. 자식 클래스에서 부모 클래스의 메서드를 사용하기 위해서 super 키워드 사용
 * 		5. 상속을 할 때에는 extends 키워드를 사용하며, 자바에서는 단일 상속만 지원.
 * 		6. 메서드 오버라이드를 할 경우 @Override 애너테이션을 적용하여 오버라이드가 적용되는지 확인해야 한다.
 * 		   (필수는 아니지만 코드에 오타가 있는 경우 오버라이드 문제를 쉽게 찾을 수 있다.)
 * 		7. 모든 객체는 최상위 클래스인 Object 의 자식이다.
 * 		   그래서 모든 클래스는 toString(), equals() 메서드를 가진다.
 */
	
	
}
